app/views/avisos/suatela.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= aviso.usuario_id %></td>
        <td><%= User.find_by(id: aviso.usuario_id).name %></td>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
        <td>
            <% if User.find(current_user.id).funcao==3 %>