app/controllers/avisos_controller.rb

SELECT "avisos".* FROM "avisos"
---
  def index
      @avisos = Aviso.all

INSERT INTO "avisos" ("usuario_id", "texto", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["usuario_id", 1], ["texto", "Teste com o novo repositório"], ["created_at", "2018-11-14 15:07:05.598066"], ["updated_at", "2018-11-14 15:07:05.598066"]]
---
  def criar_aviso
      @avisos = Aviso.all
      @aviso = Aviso.new
      @aviso.texto = params[:texto]
      @aviso.usuario_id = params[:usuario_id]
      if @aviso.save

SELECT "users"."id" FROM "users" WHERE (apartamento like '2')
SELECT "users"."id" FROM "users" WHERE (name like '%mar%')
SELECT "users"."id" FROM "users" WHERE (name like '%fer%')
---
  def suatela
      if params[:erros]
          @erros=params[:erros]
      else
          @erros=''
      end
      @usuarios = User.all
      @aviso = Aviso.new
      @avisos = Aviso.all
      if params[:ident]=='1'
          if not(params[:texto].blank?)
              @avisos = @avisos.where("texto like ?","%#{params[:texto]}%")
          end
          if not(params[:nome].blank?)
              @avisos = @avisos.where("usuario_id in (?)", User.where("name like ?","%#{params[:nome]}%").ids)
          end
      end
      if params[:ident]=='2'
          if not(params[:texto].blank?)
              @avisos = @avisos.where("texto like ?","%#{params[:texto]}%")
          end
          if not(params[:autor].blank?)
              @avisos = @avisos.where("usuario_id in (?)", User.where("name like ?","%#{params[:autor]}%").ids)
          end
          if not(params[:apto].blank?)
              @avisos = @avisos.where("usuario_id in (?)", User.where("apartamento like ?","#{params[:apto]}").ids)

SELECT "users"."id" FROM "users" WHERE (funcao like '1')
---
              @avisos = @avisos.where("usuario_id like ?","%#{params[:autor_id]}%")
          end
          if not(params[:funcao]=='0')
              @avisos = @avisos.where("usuario_id in (?)", User.where("funcao like ?","#{params[:funcao]}").ids)

DELETE FROM "avisos" WHERE "avisos"."id" = ?  [["id", 4]]
---
  def destroy
    @aviso.destroy

SELECT  "avisos".* FROM "avisos" WHERE "avisos"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_aviso
      @aviso = Aviso.find(params[:id])