app/controllers/encomendas_controller.rb

  def index
    @encomendas = Encomenda.all
---
SELECT "encomendas".* FROM "encomendas"

  def create
    @encomenda = Encomenda.new(encomenda_params)

    respond_to do |format|
      if @encomenda.save
---
INSERT INTO "encomendas" ("arrival", "name", "apart", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["arrival", "2018-11-13"], ["name", "moça do segundo andar"], ["apart", "11"], ["created_at", "2018-11-13 23:46:42.756482"], ["updated_at", "2018-11-13 23:46:42.756482"]]

    def set_encomenda
      @encomenda = Encomenda.find(params[:id])
---
SELECT  "encomendas".* FROM "encomendas" WHERE "encomendas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]